_Rarzrabotki/BASEBuh/Catalogs/СтруктураСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СтруктураСебестоимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗастосовуватиПеревіркуОдиниць</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСовпадает</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Catalogs/СтруктураСебестоимости/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого СтрокаТабличнойЧасти Из Комплектующие Цикл
		
		СтрокаТабличнойЧасти.ЕдиницаОбщееНазвание = СтрокаТабличнойЧасти.ОбщееНазвание.Единица;
		
		Если СокрЛП(СтрокаТабличнойЧасти.ЕдиницаОбщееНазвание) <> СокрЛП(СтрокаТабличнойЧасти.Единица)
			  Тогда
			СообщенияОбОшибке = " Рядок "+СокрЛП(СтрокаТабличнойЧасти.НомерСтроки)+Символы.ПС+
			"одиниця виміру загальна назва " +СокрЛП(СтрокаТабличнойЧасти.ОбщееНазвание)+" " +СокрЛП(СтрокаТабличнойЧасти.ЕдиницаОбщееНазвание)+ "<>" + СокрЛП(СтрокаТабличнойЧасти.Единица); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщенияОбОшибке);
			СтрокаТабличнойЧасти.НеСовпадает = Истина;  
			     

		ИначеЕсли СокрЛП(СтрокаТабличнойЧасти.ЕдиницаОбщееНазвание) <> СокрЛП(СтрокаТабличнойЧасти.ЕдиницаСС) Тогда
					СообщенияОбОшибке = " Рядок "+СокрЛП(СтрокаТабличнойЧасти.НомерСтроки)+Символы.ПС+
			"одиниця виміру загальна назва " +СокрЛП(СтрокаТабличнойЧасти.ОбщееНазвание)+" " +СокрЛП(СтрокаТабличнойЧасти.ЕдиницаОбщееНазвание)+ "<>" + СокрЛП(СтрокаТабличнойЧасти.ЕдиницаСС); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщенияОбОшибке);
			СтрокаТабличнойЧасти.НеСовпадает = Истина;  
	
		Иначе
			СтрокаТабличнойЧасти.НеСовпадает = Ложь;
		КонецЕсли;
		
	СтрокаТабличнойЧасти.Цена = ?(СтрокаТабличнойЧасти.Количество<>0,Окр(СтрокаТабличнойЧасти.Сумма/СтрокаТабличнойЧасти.Количество,2),0);	
	КонецЦикла;
	
КонецПроцедуры
